{
  "name" : "Spring 2016",
  "slug" : "spring16",
  "first_date" : "2016-01-20",
  "start_time" : "20:00",
  "end_time" : "21:00",
  "location" : "Wean 5421",
  "ical_desc" : "A series of talks and workshops on some of the most useful tools for advanced users and developers led by the Carnegie Mellon University Computer Club.",
  "web_desc" : "<p>Have you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!</p>",
  "web_suggest" : "<p>If you would like to request, propose, or volunteer a talk, join us on IRC or email your talk idea to talks@club.</p>",
  "categories" : [
    "Computing Basics",
    "Computing History",
    "Privacy and Security",
    "Creative Computing",
    "Languages",
    "Awesome Hackery"
  ],
  "talks" : [
    {
      "title" : "Useful Command Line Workflows",
      "cat" : 1,
      "notes" : "command-line.html",
      "desc" : "Use the command line now and then, but find it to be tedious and painful? Just want to sharpen your skills and efficiency with command-line use? In this talk, we will present several slick workflows which allow you to accomplish tasks quickly and efficiently from the command line, from grabbing videos off of YouTube to easily switching between running, compiling, and testing your code."
    },
    {
      "title" : "The Dot Com Bubble",
      "cat" : 2,
      "notes" : "dot-com-bubble.pdf",
      "desc" : "In the late 1990s, the Internet appeared to be a never-ending sea of free money.  Tech stocks were all the rage, and anything with \".com\" in the name was a guaranteed moneymaker.  But it was not to last.  Many entrepreneurs lost their fortunes overnight, and \".com\" went from being a buzzword to a swear word.  In this talk we'll discuss the Internet bubble, and how you can avoid making some of the same mistakes."
    },
    {
      "title" : "Introducing the X68000: Japan's 16-bit Beast",
      "cat" : 2,
      "notes" : "x68000.pdf",
      "desc" : "In 1987, Sharp released the most powerful 16-bit home computer of all time: the X68000. Powerful hardware and great developer support made it a gamer's dream machine all the way into the mid-1990s. Join us to explore the story of this incredible piece of hardware that sadly never made it out of Japan."
    },
    {
      "title" : "PGP and Public Key Cryptography",
      "cat" : 3,
      "notes" : "pgp.pdf",
      "desc" : "PGP was the first widely used application of public key cryptography.  Come learn about the history of PGP, how it works, and what it's used for today."
    },
    {
      "title" : "Privacy Technology and You",
      "cat" : 3,
      "notes" : "privacy-tech.pdf",
      "desc" : "Governments and corporations alike stake their livelihoods on systematic invasion of computer users' informational privacy. Fortunately, multiple tools for blocking behavioral tracking and protecting the contents of your communications exist. Learn about tools for your desktop and mobile devices that help protect users from prying eyes."
    },
    {
      "title" : "Authoring Text Adventures",
      "cat" : 4,
      "notes" : "http://bescott.org/if/talk/",
      "desc" : "Text adventures range from humorous Infocom titles to sophisticated works of Interactive Fiction. In this workshop, you will learn both how to program in TADS 3 (a language specifically for writing Interactive Fiction), and how to use this unique format to write compelling adventures."
    },
    {
      "title" : "What is AI and Why Should I Care?",
      "cat" : 4,
      "notes" : "ai-intro.pdf",
      "desc" : "You may have heard that artificial intelligence is the new big buzzword in computer science, but what is it, really? Come and get an overview of AI, from popular methods to innovative applications (IBM Watson, anyone?) to what it looks like when things go wrong."
    },
    {
      "title" : "(Spring Break)",
      "cat" : 0,
      "notes" : "",
      "desc" : ""
    },
    {
      "title" : "Haskell for SML Programmers",
      "cat" : 5,
      "notes" : "haskell.html",
      "desc" : "Haskell is a strongly typed, lazy, purely functional language.  We'll dispell some myths about Haskell, explain all the buzzwords, and introduce (and hopefully demystify) the dread Monad."
    },
    {
      "title" : "COBOL: 57 Years Old and Still Punching (Cards)",
      "cat" : 5,
      "notes" : "cobol.html",
      "desc" : "In the 1950s, languages such as COBOL and FORTRAN were a refreshing change from everything being written in assembler.  Today they're seen as scary old junk, but that \"old junk\" still keeps a lot of the world running.  (Yes, this talk is intended to be at least partially humorous... Come on, it's a talk about COBOL in 2016.)"
    },
    {
      "title" : "Verilog & FPGAs: Programming Hardware",
      "cat" : 5,
      "notes" : "verilog.html",
      "desc" : "Hardware description languages let you design digital logic as easily as writing a program.  FPGAs allow you to see that design in a real chip without spending millions on custom silicon.  Attend this talk to learn about hardware description languages (HDLs) and how programmable logic works."
    },
    {
      "title" : "Build a JIT Compiler in 60 Minutes",
      "cat" : 5,
      "notes" : "jit-compiler.html",
      "desc" : "Compilers: not as hard as you think! This interactive workshop will teach you the architecture of modern compilers and have you write one of your own. Experience with SML or OCaml is recommended."
    },
    {
      "title" : "Apple 1985-1997: The Jobless Years",
      "cat" : 6,
      "notes" : "apple.html",
      "desc" : "Apple is a company whose history is well-documented. However, emphasis tends to be put on the company's time under the leadership of Steve Jobs. In this talk we'll be discussing Apple under the tenure of CEOs John Sculley, Michael Spindler, and Gil Amelio, and the causes of its decline in the 1990s."
    },
    {
      "title" : "CoffeeScript => WebGL Solar Systems!",
      "cat" : 6,
      "notes" : "coffeescript.html",
      "desc" : "CoffeeScript is a nifty little language which can be used to write simultaneously more clear and more complicated code. In this workshop, we will examine some of the more interesting consequences of using CoffeeScript with existing JavaScript frameworks."
    },
    {
      "title" : "Real-Time 3D Graphics from the Ground Up",
      "cat" : 6,
      "notes" : "3d-graphics.html",
      "desc" : "Ray-tracers can draw beautiful, detailed computer-generated scenes, but they can take hours (or days!) to draw one frame. So how do video games draw 3D scenes when they have less than 30 milliseconds to output a frame? This talk draws back the curtain on systems like OpenGL and DirectX, to show you how they work under the hood."
    }
  ],
  "url" : "http://www.cmucc.org/talks",
  "sponsor" : {
    "name" : "Green Hills Software",
    "url" : "http://www.ghs.com",
    "desc" : "Green Hills make the world's highest performing compilers, most secure real-time operating systems, revolutionary debuggers, and virtualization solutions for embedded systems.",
    "logo" : "assets/ghs_logo.svg",
    "logo_svg-gen_height_offset" : 48
  }
}
